#+TITLE: Development notes for ProbCompCert
#+STARTUP: hideblocks
#+LATEX_HEADER: \usepackage[margin=1.0in]{geometry}

The aim of this document aims to provide a roadmap to the current ProbCompCert
codebase (revision 0f5530f6 on the feature/targetproof branch). It is a review
of  development workflows, debugging tips, and learning challenges for myself
([[https://github.com/stites/][stites]]). The current status of the work, and the expected next steps, form the
final section of this document.

* A motivating example
At a high level, when navigating ~stanfrontend/~, all transformations can be
summarized as being found in ~driver/Sparse.ml~, responsible for parsing and type
resolution, and ~stanfrontend/Scompiler.v~, which runs the remainder of the
pipeline.

Note that, at present, only the density compilation has been verified. Given a
Stan program ~simple.stan~ a library in the form of a ~simple.s~ will be
produced instead of a runnable binary. To perform inference on the described
model function, the provided ~Runtime.c~ must be compiled with the resulting
~simple.s~ to produce a runnable binary. This is described in more detail in
[[id:c4a1d2d3-7ccf-4b21-94af-1a659f3fa204][Compiling and running]]. The required C files for compiling are described in
[[id:30d19e92-b786-43e7-ae73-52bcebba8592][Additional C files]].

Given the following program ~simple.stan~:

#+BEGIN_SRC sh :results output drawer
cat ../stanfrontend/tests/simple/simple.stan
#+END_SRC

#+RESULTS:
:results:
data {
  int flips[100];
}
parameters {
  real<lower=0.0,upper=1.0> mu;
}
model {
  mu ~ uniform(0,1);
  for (i in 1:100) {
    flips[i] ~ bernoulli(mu);
  }
}
:end:

We initially want to take the parsed ~Stan~ AST (defined in [[file:~/git/ProbCompCert/stanfrontend/Stan.v][Stan.v]]) and enrich
it with type information (defined in [[file:~/git/ProbCompCert/stanfrontend/StanE.v][StanE.v]]). This "elaborated Stan" forms our
first intermediate representation and still closely resembles the original Stan AST.

Shortly after, StanE is transformed into CStan, which remains the intermediate
representation of choice for the following, ordered, transformations:
1. converting sampling statements ~_ ~ uniform(0,1)~ and ~_ ~ bernoulli(mu)~ into external C calls from the packaged ~libstan~ library.
2. moving all free variables into one of two structs, the "parameters" struct for ~mu~ and the "data" struct for ~flips~.
3. applying the constraint transformations of ~lower=0.0~ and ~upper=1.0~ to ~mu~ (according to the Stan documentation).
4. removal of the implicit target expression returned at the end of the ~model~ block.

Additional library functions will be generated to get and set a generated
parameter struct as well as to initialize data from the command line (a work in
progress).

** Miscellaneous files
while in ~stanfrontend/~ we see:

#+begin_src sh
ls ../stanfrontend | grep 'v$' | grep -Ev "(Stan|CStan|Scompil|Denum|Sampl|Constr|Variable|Target|Sback)"
#+end_src

#+RESULTS:
| Runtime.v    |
| Sops.v       |
| Sparser.v    |
| Ssemantics.v |
| Stypes.v     |
| Sutils.v     |
| System.v     |

- Runtime.v :: compcert-compiled Coq file of ~Runtime.c~.
- Sops.v :: Stan operators
- Sparser.v :: The output parser from ~Sparser.vy~
- Stypes.v  :: Stan types
- Ssemantics.v :: A placeholder for the final semantics of a StanE program
- Sutils.v :: An attempt to share utility functions across modules
- System.v :: initial attempt to state the desired final theorem of ProbCompCert

